<unk>
<pad>
<sos>
<eos>
<MASK>
 
이
다
.
는
에
의
을
가
고
하
지
로
한
은
그
서
기
어
나
도
,
아
를
사
리
자
있
들
대
시
라
으
것
인
니
수
해
게
정
보
만
일
었
부
구
면
주
적
과
여
'
제
상
장
전
러
거
내
우
문
마
소
했
무
1
국
요
생
성
위
되
오
?
스
동
말
없
야
신
애
비
개
치
모
원
화
조
와
할
려
경
미
데
0
간
때
히
까
재
세
더
당
선
계
단
안
않
중
"
두
회
물
운
학
관
바
2
실
진
음
공
유
디
연
래
방
교
각
분
명
며
람
던
)
저
체
(
르
식
용
드
눈
산
된
차
달
았
영
작
터
통
처
년
등
발
3
금
울
민
습
속
입
같
반
행
였
따
예
새
!
5
런
심
불
결
현
난
타
남
건
집
른
버
9
감
업
파
양
배
4
호
본
역
직
후
노
느
강
살
점
네
루
또
담
머
외
못
력
설
알
날
너
란
질
트
형
매
든
번
레
태
허
피
표
6
법
8
누
함
포
판
렇
종
겠
린
임
받
목
편
근
천
늘
씨
돌
권
능
초
많
론
언
7
녀
출
추
길
절
합
럼
변
얼
료
올
술
군
약
월
열
온
져
티
록
준
잘
겨
키
채
석
름
청
손
순
걸
김
프
향
최
평
크
냐
복
박
책
증
글
랑
격
뒤
독
테
환
백
앞
댜
활
망
왔
-
투
특
급
참
e
친
께
련
써
님
갈
품
필
병
좋
워
놓
둘
듯
줄
토
쳐
막
카
큰
먹
끼
항
움
렸
잡
승
별
쓰
될
응
창
벌
확
극
침
억
림
긴
쪽
족
철
죽
떠
북
a
졌
굴
o
곳
코
령
i
악
존
색
맞
혼
삼
육
희
싸
규
패
괴
견
락
익
찾
n
황
잠
갔
셔
총
뿐
빠
험
광
접
축
닌
t
떤
엇
혀
볼
깨
송
r
룰
싶
째
류
밖
잔
튼
득
귀
몇
골
취
먼
엄
끝
농
답
밀
립
꼬
갖
햐
돈
충
쟁
논
힘
검
찌
몸
므
꾸
%
틀
찬
났
왜
숙
m
짜
갸
럽
커
덕
넘
믄
늬
헌
례
메
찰
즈
웃
켜
베
앉
범
슨
s
끄
c
힌
브
효
협
돼
량
떻
몰
떨
앴
봉
됐
헤
릴
놀
십
높
슬
늦
둥
퍼
팔
측
택
칠
릐
밤
완
풀
l
징
붙
왕
흐
앤
>
꺼
뜻
<
욱
념
밝
좀
풍
C
듸
탄
큼
즌
얘
갑
윤
암
짓
혹
착
:
곤
땅
흘
슈
엔
욕
탈
츼
츠
됴
앙
랴
츨
놈
닥
씩
빈
획
숨
염
층
율
혁
푸
걱
곧
빛
슴
즉
폭
덩
흔
곡
옥
뜨
A
늠
짐
즐
틔
낸
죠
죄
벽
샤
페
읽
앨
플
잇
랐
삶
빨
펴
~
닐
묘
끌
T
S
궁
휘
홍
늩
뿌
렀
듣
뭐
객
넣
뛰
늨
웠
척
첫
셨
및
쟈
h
꽃
봐
g
얻
싱
훈
압
깊
갓
흥
쿠
쑤
짝
u
캐
밥
쳤
둔
핵
p
맡
쓸
냥
액
d
멀
탁
낙
윽
P
햔
케
긔
벼
B
혜
렵
읍
M
폐
딸
D
겁
믿
잊
/
쉽
섯
칙
덜
션
쉬
꿈
팀
벗
냈
돠
럴
둑
균
뷰
랜
옹
좌
퇴
딘
웬
혔
휴
떼
뉴
탕
옷
낮
롸
쇼
샌
컴
쇠
꼭
I
묻
칼
y
젊
롭
묵
밑
킨
섭
섰
빼
빌
K
G
즘
찍
촌
졸
N
잉
옆
널
쯤
춘
넌
겼
맨
k
략
쥬
겻
젖
겄
O
클
맛
랬
씬
믈
섬
읓
맥
눌
읗
깔
읖
딜
블
랄
칸
웨
씀
낭
뮤
듬
L
뚜
껏
퓨
엉
덧
텔
쩍
잖
겅
쩌
웅
뢰
롯
솨
램
멍
햇
넓
힐
렁
뎌
쌍
텨
혈
띠
벙
룬
촉
융
삭
값
털
E
끔
납
샐
률
릉
붕
뽀
덤
셈
쓴
읔
똑
낼
낌
녁
뇌
쥐
F
밭
룩
먄
졍
츤
잃
옛
먀
V
릇
벅
릎
몽
녹
잎
굳
댸
뵤
솔
핰
봅
핮
뒷
칭
녕
몬
끊
젼
껴
냉
뜰
괸
킬
넷
쏘
컵
흡
륵
젹
센
셩
냄
핱
옮
켰
숭
겋
=
썼
깐
w
렬
앗
싫
럿
랍
닫
삐
샹
찮
홀
b
춤
뇨
딩
얀
셰
듀
틴
엘
쪼
턴
멸
햬
넉
읕
닭
끈
읒
맹
딱
봄
잰
꾼
럭
쎄
즤
떡
탐
뎨
R
롱
쭈
낳
닙
젇
긍
쌀
헐
]
콩
뭉
졔
맘
훨
딴
훌
[
켠
빙
젠
봤
쁜
픈
f
걔
욘
틈
릏
쵸
첨
겪
곁
깜
겉
엽
멈
챠
샘
왼
젓
릋
댁
엿
멋
튀
랫
걷
슷
뉘
쫓
곱
굼
땀
룹
싼
돋
흑
팽
픔
뮨
탸
컨
쁘
쿤
젙
듳
욜
펼
춰
쩨
쌔
꽈
쌓
닜
딨
맀
쾌
꼴
릿
긋
핀
헝
텍
쩡
칬
쇄
똥
듷
콜
뀌
쏟
짖
끗
x
넝
퉁
뭇
벤
뽑
썩
낯
싀
솟
팄
잌
쩐
둠
뭔
델
펀
쟝
숩
뻐
눙
톤
귝
짱
렷
뚝
뚱
잭
긱
픽
굥
갱
홈
H
괜
븐
숫
혐
붉
흙
짧
맺
쩔
굽
겸
v
굿
옳
탓
틸
빵
샅
U
렴
냬
듶
댱
뤄
잽
턱
앱
땨
뎐
덮
녔
앖
팅
줌
뱌
몉
잗
섞
룡
듭
엾
뤼
푀
첩
셋
썽
놔
좁
둉
늙
흰
빚
숲
갘
퐈
됨
곰
템
텅
줘
겐
뻔
벨
잍
꺄
튜
츄
툭
링
룸
닿
얄
힉
뙤
깡
맑
낀
띄
됩
쳬
닷
푼
텐
팍
랭
갇
꼈
뜩
낄
핑
빗
닦
젗
삽
쳔
릅
엎
헉
흉
륭
W
폰
깃
댠
촤
깥
렌
묶
딤
돤
쑥
꾹
탑
잴
겹
즁
팬
묜
콘
몹
뮬
넜
샜
폴
릭
젘
밟
꽁
툐
팼
뼈
꼽
횡
걍
꼐
첬
}
쿨
뭘
젂
츰
싹
팜
홰
뚫
짙
{
짚
꿀
녜
끓
찔
볍
캄
쌩
쨌
맠
엌
씻
덨
옵
톨
닽
갤
섵
햘
롤
뎡
샃
몀
욤
셜
팡
낱
빅
컬
잣
퀴
싴
먈
잋
껄
J
잏
륙
닉
챙
쳥
뭄
텄
떄
밍
맙
믜
댤
몫
맣
흠
훔
뷴
앵
냔
랗
썬
섣
궨
몈
낫
꼼
갼
깝
솜
잧
툥
앰
뱃
댔
뜬
콤
몆
툴
웰
뿔
닝
쭉
펄
핏
꿔
갹
봇
톼
뭍
갗
햤
붓
딪
뜯
얐
빤
롬
씰
굉
칩
툰
칫
헀
헸
핸
눤
톱
힜
꽤
잩
탔
푹
괄
삳
썰
콧
헛
멘
롼
눠
X
깍
덥
섳
줬
햑
셀
얹
꺾
뱡
뤈
셍
쁨
겿
맏
깅
굮
펜
걀
볕
뱅
싣
랙
촬
넙
댬
윗
섕
딥
씁
솬
랔
뻗
돛
읺
댄
꾜
룻
둰
텬
맟
둣
옴
윈
뭊
옅
얺
곽
섹
찐
붐
얂
껍
뭌
챔
럐
캠
엊
먕
밫
챈
갬
웡
깁
낞
샏
덴
탱
햄
Y
겯
굶
팩
녘
긐
낰
엳
밪
펑
핫
찼
흩
횔
닮
잦
꼉
뷸
킹
싯
틱
럄
뵈
땐
찢
싲
셕
쏙
짤
낡
앓
돝
횐
줕
뱔
뇽
깎
켱
둬
뜸
눅
뱐
갠
얽
홉
꽂
엮
갚
쿄
랕
꾀
샡
씌
컷
쟤
돕
샟
샀
넚
굵
힙
핯
씸
텂
핟
랩
쳑
럾
뒨
팰
쭝
닻
놋
벚
똘
퍄
졈
씹
됀
덦
캔
뵨
싵
욌
톡
켓
깉
빡
닺
싳
첪
맢
낚
휩
힝
z
갯
컥
헙
폈
떳
핍
뱉
퉌
춴
헬
밴
겟
;
줃
룍
댕
꽌
냠
웜
닸
닼
렉
꿰
줓
웤
딕
젤
핚
졀
웥
랸
껀
늑
튿
핳
j
믹
슺
곷
앚
뫃
툼
싷
뎍
샨
뿜
잒
핲
앜
궤
슐
톄
괕
멱
돗
섲
뇬
솥
뎔
륜
겍
렄
찻
춍
컸
웈
웢
갂
솓
쟉
눔
꽉
뚀
옄
묭
킴
퍽
칵
궐
밈
밎
븨
섴
슥
걑
@
짘
큐
닪
앝
츌
줍
챵
탆
엏
릌
렿
텁
쇽
옃
콕
퐁
랂
뻘
혙
됭
헹
횬
퍈
듵
떴
뎠
+
뷔
쑬
캬
곹
훼
핌
왠
굘
찹
왈
뒈
뭏
볶
앟
퍙
밸
앛
붘
놨
쪄
샄
룐
괒
핼
괘
뙨
뭋
죈
괌
냘
쵀
뭎
뱍
옂
닾
얃
싞
괔
뉸
뜽
빕
넨
궂
맬
껑
둡
멎
왁
걈
삿
숱
멜
팝
뽁
쳘
겆
뽄
랒
좇
뭣
샬
얕
멕
긁
쎠
룽
챡
얌
왓
쏠
훙
턔
샂
헨
죵
욛
덟
챌
뱨
팁
웁
낲
꿇
뗘
텼
멉
덪
긎
엑
팎
붖
밬
뺨
뱀
펌
밧
팥
&
덭
꺽
덬
껌
쌈
냇
슌
뀐
틍
겈
붗
옇
찝
슛
샢
솎
옸
귤
웉
꿑
랠
얗
갰
웆
엠
풋
멷
몼
쭌
쉴
윌
뀨
젛
렂
혖
끠
넥
촐
젯
섀
됰
눕
폼
잤
됮
픠
팠
췄
갛
끙
빋
쌕
껼
묫
캉
밐
#
쥰
훤
쑨
쩜
랏
댈
띤
훅
겔
숟
뻑
숯
늉
됱
렆
뒀
헁
텽
맴
넋
볓
렫
햡
첳
톷
녙
짇
턍
댐
욭
욫
욨
읏
횽
댓
탠
쿼
맄
촛
짗
밯
썹
좃
톧
텀
옿
톹
븍
벋
녖
늪
곘
깈
첮
됼
쫑
뻡
펵
뚤
빧
긑
먜
쿵
돔
줏
쯔
찡
긨
젝
캘
Q
픙
밮
졷
첱
뢍
춧
짠
뒜
돟
핻
_
봍
밚
늧
냅
귓
샛
폍
뿍
줗
볌
츅
렅
햠
엣
횟
웋
냑
짂
퓸
쫄
뱓
묙
맂
훑
쉰
렦
짛
샴
팢
윰
얇
녈
렘
빔
윳
혘
찜
칺
쓱
곃
샙
햋
욍
쥔
웹
벜
햍
멩
먆
쥴
믾
텩
얏
탹
좊
텃
챼
웍
칰
칮
먾
땡
뵬
릊
릍
찯
봊
둗
떵
뭬
쿰
뵥
킥
톰
뚯
졋
딛
탬
곂
좉
슘
붛
퉈
봌
췌
춥
뻣
맊
잼
듲
됵
앋
렜
잿
닠
붚
펠
뺏
혇
눚
죤
뼌
뽕
챀
숀
옐
셌
샇
뾰
좆
뺘
큭
쏜
눗
섷
렛
솽
쑴
뎄
뵹
넛
씅
쭐
얖
깆
뷱
롣
얓
밋
껬
쟐
킁
벡
뱇
옾
댝
춫
몯
휙
짬
챗
깋
퓌
굑
뒹
푠
첯
볐
쥭
홛
넬
땋
슭
혗
몪
랃
섶
곻
*
믕
켈
쌌
샆
뢀
빽
탖
봏
컹
볻
첟
밉
숸
쨔
놏
컫
퐌
첸
곶
멤
윙
풉
즏
벝
먁
훗
꿘
늄
홫
뤘
즙
숰
홭
눟
럈
듴
꿍
낵
챰
깬
옻
짊
븡
롲
츙
맫
뺀
웇
듈
솰
첰
깇
