<unk>
<pad>
<sos>
<eos>
<MASK>
임
흠
놔
출
돠
쟈
밀
둡
붉
섯
윷
갚
컷
경
딱
꼈
앵
쑴
T
답
료
딮
썰
글
늪
폴
껍
큘
갔
받
쭈
뜸
찼
싼
퓸
례
푼
즈
휜
핀
$
켠
굶
뀌
잼
세
넹
씬
팔
윛
좌
현
샤
쪄
냐
댐
헀
템
놀
렉
멈
균
룬
멀
뙇
른
밨
엔
절
긁
륜
쩍
쳇
n
쏴
:
첼
H
렁
룻
돗
닌
짊
급
뮌
낱
웍
쏜
솥
테
냠
멕
썼
될
춴
u
흫
쩨
델
랙
릳
밤
갭
뉠
끔
믄
샌
록
렇
갗
셋
맥
님
g
췟
됴
캄
토
끈
쥘
괄
커
럭
꿰
팀
얕
찮
슈
즌
신
워
널
랗
삔
쯤
밈
닥
딴
횡
았
뻴
퓨
땋
틸
튄
댜
죄
뎈
틑
범
삐
늑
훼
젭
쫒
띤
동
석
척
철
곽
폽
야
뉴
벅
길
풀
퓰
눔
눈
뚝
맞
펠
걱
찜
뇬
꺽
ㅆ
랑
백
짆
힐
맘
뺍
성
뭔
어
공
욱
춥
음
뮤
용
U
샐
껌
ㅁ
쏟
쿵
햤
읕
뤠
뀝
떄
붸
훔
휙
궤
ㄹ
노
좆
딩
띈
잚
보
2
귈
뱃
욧
홉
꼭
뻗
A
펩
션
ㅏ
문
육
뺏
컾
싹
돋
벚
=
랬
겪
뜻
런
젛
걷
쨈
죠
콤
축
쩅
됨
탭
퍼
뺑
쳤
궜
랐
찰
웊
챡
쨩
쫘
틴
셤
0
롯
슭
릅
푀
읎
뉘
큰
꿨
샘
빨
민
류
뻑
멩
깻
히
욤
헝
딹
몃
와
헿
 
V
ㅋ
쉴
질
큿
궂
듫
탈
뽜
휠
낭
점
눙
펭
줫
깆
잇
긴
향
핥
썩
꿋
램
잃
설
짐
믈
Y
켰
닼
킼
넝
첩
탯
1
옵
뵈
땅
R
슙
캔
낚
측
겻
콘
썬
잦
서
봤
학
캉
쇼
찡
껼
움
컹
ㄷ
냄
솝
그
컨
휼
긍
값
냉
잎
잽
욺
숱
믹
립
품
웃
쨘
갠
쩝
카
판
잭
뚱
펍
캣
희
춧
듯
튠
잴
뿍
꺾
앰
차
펼
섰
롹
팟
창
벽
친
타
룹
밸
롱
룡
렜
륙
흘
꽐
험
든
밍
깔
줬
갛
려
끅
땐
퉁
읔
!
듕
흉
많
뇨
캅
싫
7
썹
억
좋
딧
썽
볐
붓
튿
꿍
뺼
힣
베
단
복
샴
장
떠
ㅐ
팝
j
부
ㅜ
땨
갇
딥
꾸
완
픈
r
딘
탐
췌
침
빛
ㅉ
짭
뀨
골
탁
풋
퀵
잠
x
맡
농
띁
렘
짜
뇌
ㅌ
잘
뿐
뜩
댈
채
고
헉
눗
잖
훅
낮
뷔
안
하
ㅈ
뒈
에
함
비
쭤
5
깼
흑
률
엎
픕
뻤
쓔
됫
이
티
삭
씻
간
꽝
뱉
핵
찍
잰
컫
띄
씽
멓
딨
`
틈
씰
광
킵
얄
갖
쯔
녤
컥
끕
뽝
퓌
끙
락
둣
걔
씹
탕
뛰
듸
딕
룸
퀸
팁
앗
알
니
졌
빌
뷁
빈
빠
뎀
푠
앜
색
튈
멍
춘
제
{
빴
촥
슝
펙
쫌
뜨
굥
표
펴
먼
조
e
털
졸
욯
콱
면
콕
뜰
갑
쨍
w
톰
낑
찬
쌔
똻
무
달
햅
쪼
림
낫
겜
업
옷
덥
래
싶
닦
짙
휑
쩐
얘
법
셜
했
맨
쩜
긜
코
꺋
형
뚤
짤
귓
뽐
블
녀
퀀
듬
로
깹
냈
쿱
윳
샵
헬
캍
N
펄
섞
탠
t
큭
컬
앉
둬
핼
뎁
멎
꼼
밭
핏
숩
뭅
꿇
벙
링
뺄
쓸
옜
깊
홓
즉
갸
셔
떱
싣
뜹
뒀
맺
흥
눼
트
결
짠
씩
깁
좀
귤
뒷
옆
건
껐
맣
얜
엿
헷
퀘
층
찹
땡
z
툼
난
짹
롷
쳐
앓
끝
옾
뻥
틔
청
켤
푹
생
F
왓
툴
목
/
랩
뗐
닿
픽
맵
콧
닉
얻
나
밧
꽛
격
맷
싸
짱
뤄
잣
섣
물
막
줌
각
6
욥
훤
꿔
브
떨
꼴
턴
까
겐
못
죸
읏
딛
봣
뿔
잉
짝
평
퍽
횟
오
ㅡ
왔
젤
엘
탓
|
데
꺠
던
젼
풉
실
여
흗
ㅇ
혁
흔
븐
쑵
칡
텅
컸
l
딤
d
않
텐
쥑
곱
우
당
촉
왕
악
내
징
휀
젠
릉
쑨
뱅
뢰
쇠
쫑
a
뭉
같
방
촬
4
덮
벡
팠
젝
검
끽
람
투
줘
8
종
씨
금
앱
똥
얽
팻
퐁
최
반
둥
취
놓
샹
꼰
왤
쨋
칙
랍
텍
르
닝
스
쨰
챰
엣
겨
'
떡
ㄱ
봅
를
군
셉
쓰
뾰
벳
쎄
담
팸
엻
ㅑ
쬐
액
떳
쉑
쾃
샀
둟
?
쨔
윗
빻
회
뻣
y
엽
숏
곳
f
뺀
놨
집
쓴
묶
줏
식
켓
뽑
곤
북
합
젬
쭉
쓱
콰
훨
늄
녁
뀔
착
큽
넴
쫙
술
째
혔
핳
곘
솟
응
꼐
녓
도
잊
끌
q
해
납
겹
멜
사
쌩
떴
멱
져
봇
크
h
들
시
쏭
빤
믓
롬
밝
구
힛
의
드
컵
뱄
얼
껭
짘
병
앏
압
규
칫
튕
환
죵
큐
분
E
늬
낳
팎
레
딸
량
맙
엡
춤
갬
닭
자
[
얗
겼
뤘
옛
뚬
김
꾼
럇
원
텆
밴
G
먀
미
쫜
ㅎ
릇
럽
륀
깨
왜
;
킷
렵
꽤
휴
곡
혀
찔
씌
는
엠
셧
b
윽
썸
즂
뽕
쫓
댑
치
왼
꺄
곶
쮸
쥔
천
긇
츄
열
팽
깝
맛
m
흡
,
갤
짖
몹
늦
곁
쫏
뺨
챔
염
앨
돼
.
펐
교
땀
찢
뽈
첸
깰
념
푸
뿜
뷰
쟀
핍
루
쳌
쑤
호
칩
칵
슾
엇
궐
뭡
예
끄
직
툭
낏
탅
혜
뼘
_
섹
펑
쟎
끼
때
연
줄
긩
휩
쥐
헛
객
넷
찌
혹
ㅊ
띕
좇
슘
긋
욘
뛸
붐
샛
떙
힙
누
역
똑
휘
톻
쾌
쏠
읽
리
약
웁
쿡
넬
똘
변
꾀
딪
월
짰
력
깐
망
햐
며
웇
슐
년
앙
텀
깍
M
쵸
협
뗌
칸
싱
룩
겠
W
튼
넉
쌌
디
펜
찾
계
랏
없
읭
쾅
쉼
뫼
손
곸
냅
련
잔
웬
윤
랄
득
튀
일
웅
몫
근
총
갰
지
곧
낀
모
눌
흰
옐
몄
툇
죽
ㅣ
잌
권
P
만
맴
넥
몰
후
옥
송
옻
좐
둔
뤼
졍
짧
텼
숭
댓
넨
뎐
볏
먹
쬬
붇
되
맸
짓
두
젊
ㅔ
셨
위
똔
넣
뽁
빡
돵
탔
씀
켕
편
렛
캠
뜀
텨
쪗
닳
헌
퇘
홋
폼
욜
넜
츠
괭
케
봄
퀴
춰
+
꺼
화
새
빙
숑
찿
좔
닫
삿
뭣
쿠
튜
양
산
녹
황
렸
D
넘
헠
쁜
덟
켜
틱
렬
ㄳ
있
운
독
잡
땠
뿅
극
쒴
플
룽
빳
쳡
큗
폈
쉽
샬
팬
뿌
뮨
웡
순
퇄
옮
꽂
덩
짦
뭇
묵
깅
십
융
갯
걸
혼
솨
껏
존
궁
샷
릴
%
웩
박
똭
맟
쏙
쟇
재
귀
껴
쏘
*
슬
쁘
ㅕ
힘
닙
홧
뚭
발
탄
롭
머
@
었
팥
짢
날
멸
왁
륨
틀
륵
인
언
쟁
매
C
늙
캡
끊
필
암
쐴
앞
좍
책
띵
뇽
핌
밉
쓤
뎃
및
준
삼
뵐
쌀
뻬
ㄸ
왠
다
더
몇
붕
O
뗄
껄
얹
굉
꼬
강
웨
볍
#
증
빔
훙
댔
펀
^
닐
터
킥
킹
엑
룰
행
빼
냘
빚
엄
꾹
붙
칼
햄
울
덕
텁
작
텝
쉬
켈
허
봬
힝
띠
바
쁩
슛
피
솬
쇄
뉸
첫
숟
쉰
줍
전
것
뎅
된
삶
퉈
씸
진
<
킴
랜
겟
낡
숴
팡
또
외
좁
삽
가
곰
뷱
셈
숲
캥
읊
찝
쩌
넋
느
뜯
촐
령
뼉
략
접
꽁
댱
욪
즙
쌓
린
옶
옳
메
낸
볶
획
헨
칠
됐
딜
쯈
쟝
삑
놉
흩
엨
너
빵
웜
쿄
흙
족
핰
과
벨
갈
c
꿉
덤
뇸
둘
굽
댕
늘
켄
벤
욬
으
샥
쿰
론
넙
핫
꿈
번
씁
흐
퀄
Q
뻔
냇
턱
파
늉
핑
둿
엉
팰
벧
랫
굣
묻
젓
애
탑
뎌
꽉
웠
돌
뮬
낼
엥
롸
뼈
닷
뭘
슷
귄
셀
돔
쩡
듐
듀
국
댁
ㄴ
큣
뀐
]
껑
떻
팅
쥬
쭐
윰
촛
꿀
관
쨕
즤
뜬
듭
솔
펌
얇
깎
뤈
찟
퉜
벼
헤
팩
L
굴
Z
콜
굼
ㅃ
쫀
셰
괘
i
윙
엌
습
랴
챠
쏨
녜
큅
뒹
쨌
덴
젹
태
젖
눅
뻘
냥
상
봐
밑
ㅂ
졋
}
-
괴
큼
뻐
논
높
키
맑
첵
윈
X
늠
눴
묽
몽
J
싈
체
견
쿨
껀
얍
훗
꼽
멤
섬
멋
떤
봨
댄
픙
섭
겁
펫
랭
굵
)
덱
콥
폰
녔
놧
숄
톨
벗
능
뽀
햇
톱
팍
긔
훑
됬
"
멘
챈
훠
요
숨
을
쩔
떽
므
웹
특
렐
톳
녕
싯
~
쭝
짚
렷
럼
혈
추
올
넛
씐
버
픔
읍
튤
땜
쁠
욕
눠
혐
앤
퀼
둑
휨
괜
똠
불
속
릿
잤
웰
홀
입
낌
라
깜
빰
빗
써
기
찐
뭐
남
참
걍
께
쉘
율
활
듈
승
쿸
폐
쟌
톤
따
뚫
챱
귯
밟
클
굳
B
3
숯
얏
홈
쟤
짬
촌
포
배
충
쥼
쉿
숙
본
꺌
꽃
첨
등
츈
돕
볼
갓
떫
쑥
감
띔
네
할
츰
뛴
v
I
택
낄
쿼
맏
촵
틍
S
게
빅
밥
렴
릎
쭙
듁
덜
패
텔
뚜
얌
캬
킨
몬
륭
뱀
콩
뇰
쌉
힌
탱
릭
깬
였
덖
죤
멧
숖
쥭
찻
쌤
벌
9
닛
갱
눕
텃
쿤
렌
챕
밖
촤
말
뭍
몸
심
됩
듦
러
쪙
뎠
쩰
잿
끓
맹
챼
깽
놈
슥
쪽
훌
튭
헹
름
처
&
쫄
꿩
p
챗
솜
폭
쵝
겄
팜
옴
풍
뵙
프
영
걀
궈
렝
은
킬
퇴
쥴
ㅅ
덧
캘
톡
뭄
켯
쌍
깥
한
겸
헐
꿧
굿
끗
닮
뗀
녘
온
겔
낍
효
췄
쁨
유
옇
저
넌
항
촘
대
묘
캐
숍
빕
익
렀
볕
아
선
K
k
중
넓
롤
툰
뒤
듣
꽈
컴
살
즘
귿
럴
왈
낯
명
났
쌈
탬
ㅗ
초
정
챙
s
거
핸
젯
센
헥
밋
>
엮
뜌
수
홍
별
랠
확
럿
o
ㅓ
(
엊
쎈
긱
훜
숮
훈
옹
뼛
큄
깡
마
소
쐬
개
섀
뺐
통
란
돈
밌
주
낙
옅
썻
겉
쉐
렙
쒸
챤
ㅠ
꺅
킄
얀
페
쪘
삘
칭
츤
믿
뚠
적
즐
쭌
슨
깃
쌘
슴
봉
숫
윌
슉
둠
떼
앴
츼
릐
츨
늩
늨
햔
읗
겅
읖
읓
겋
먄
괸
뵤
댸
핮
셩
핱
샅
읒
졔
뎨
햬
젇
엾
릏
릋
젙
탸
듳
맀
닜
듷
귝
칬
팄
뙤
잗
싀
듶
몉
앖
잍
힉
뱌
냬
퐈
빽
갘
둉
탤
홰
쳔
냔
쳬
젗
팼
즁
돤
젘
툐
샜
젂
묜
닽
섵
텄
쳥
햘
돛
첬
뎡
싴
샃
덨
잏
잋
맠
뷴
몀
몆
먈
궨
놋
갼
꼿
섳
몈
셍
갹
툥
얐
톼
삳
롼
잧
잩
헸
굮
힜
햑
닻
텬
겿
랔
꾜
겯
뱡
샏
뭌
댠
둰
뷸
섕
뭊
밫
쯧
얂
먕
긐
낰
엳
뭏
줕
얺
셕
읺
횐
낞
켱
엷
횔
럐
돝
헙
럄
밪
꼉
랕
뱔
싲
됀
떵
줃
눤
샡
뱐
핟
퍄
쳑
샨
섶
맬
웢
졀
싵
룍
찧
맢
웤
뒨
졈
첪
싷
뵨
샟
괌
욌
퉌
챌
웥
줓
핯
슺
텂
홑
싳
닺
잒
앝
꽌
괕
쇽
춍
핚
깉
곷
섴
핲
앚
럾
댤
톄
솓
겍
넚
덦
렄
섲
츌
걑
옃
갂
뫃
뎍
묭
랸
쟉
밎
웈
솎
죈
됭
탉
랂
샄
횬
뉜
뎔
앛
퍈
혓
듵
겆
덫
챵
앟
곹
혙
옄
뚀
쌕
틋
챘
넸
쇤
쑬
붘
렿
릌
뙨
쵀
겊
퍙
괒
엏
뽄
굘
싞
괔
뜽
탆
닪
뭎
멉
숀
뭋
폄
닸
욛
짇
옂
쳘
턔
룐
랒
슌
옸
뱍
샂
얃
앳
꿑
덭
쇳
빋
걈
붖
믐
혖
덪
닾
쎠
됱
됰
멷
삯
긎
덬
댬
벋
뗘
욍
밐
벵
밬
됮
렫
뻡
겈
뱨
쐐
깄
묫
욨
샢
욫
횃
헁
낲
볓
렂
좃
땄
웉
붗
첮
홱
킁
셌
톹
녙
쥰
웆
욭
깈
톷
몼
맄
횽
곯
끠
븍
텽
빧
렆
첱
턍
녖
톧
돟
햡
첳
츅
졷
폍
펵
픠
긨
먜
밮
뢍
햠
핻
옿
앎
밯
옌
긑
묙
짛
뚯
줗
뒜
짂
맂
봍
볌
햋
땔
냑
붛
싰
짗
햍
팢
꽹
렦
겡
뙈
셸
웋
뱓
샙
됵
좉
좊
됼
밚
칺
먆
칮
찯
봌
텩
챀
낵
벜
녈
혘
뭬
봊
얖
얓
칰
탹
믾
곃
곂
먾
뵬
혗
뵥
꽥
렅
닢
캤
섷
뱇
릊
맊
첯
눚
늧
붚
굑
꿘
곻
둗
혇
샇
앋
춫
댝
폿
뼌
뵹
솽
콸
솰
꼍
닠
몯
몪
릍
졉
쟐
듲
깟
띨
븡
롣
샆
캑
껬
즛
풐
봏
뢀
츙
벝
탖
깋
숸
홛
첟
뮈
퉤
껵
즏
뗏
첰
럈
헴
씅
뼐
렽
놏
볻
퐐
깇
쾨
먁
뎄
맻
홭
뤌
곴
퐌
빝
숰
뒬
꿎
갉
쳣
롵
넢
돨
텰
뿡
엍
뺘
궅
눃
맽
랃
맫
푱
챋
홫
롲
듴
깠
앾
죻
뗜
맅
듰
굔
셥
퐉
퍠
엋
눟
됄
똬
욀
솩
궡
궠
숳
폊
펗
궝
궘
뼝
슽
챽
낟
춮
헣
좈
롴
눨
웼
떺
렺
튺
덯
죡
밲
괼
붂
롞
볃
갶
밷
랖
춸
챁
앩
춯
놰
웧
캊
믕
웣
탚
걌
챂
롰
웦
폌
쁀
읜
뿥
셴
둴
흣
끜
쟙
쭘
솤
덛
죰
챆
볒
돆
볜
믜
늗
춛
죌
좨
됏
돞
즟
퉐
볔
몌
옽
뱩
쯩
겝
쬭
잨
벟
끛
돽
뵌
땟
궞
잫
픅
먖
뙬
팤
휭
윧
냤
퓽
폋
씉
줔
궄
햗
옺
눝
뀜
뗠
줒
놐
먿
랓
듄
옼
멏
놑
몿
탰
잪
홤
궃
쫃
뗳
슻
쫗
힢
밒
븨
쌰
죨
챶
눜
쮜
먺
젚
뺌
룠
펨
촏
븉
젔
햩
쪾
죴
댭
젱
늫
즡
솢
햧
랼
힠
읃
봋
횩
홖
뢔
벆
앂
땁
닡
핗
홪
뫀
졲
빆
뱎
겇
눞
녗
홬
귺
홯
챨
슫
퐝
좄
켳
텡
콯
홮
핓
닞
윔
뱜
쟘
펻
쟜
걎
긷
떰
폅
됸
됙
윢
닟
빢
빞
헜
넠
칱
앆
긓
곀
뫂
곬
껸
몊
귱
홐
됲
붜
죾
멑
삥
캇
톈
촡
핖
왙
띌
얶
츧
썅
곪
볗
돴
츳
뢌
묠
맜
퀭
뻠
풏
퇐
줖
멥
븥
맆
쎴
녑
켬
롄
뱁
잙
쩧
앯
볖
옭
왳
쀼
껗
띾
쟅
켐
쑹
첲
짔
켸
웄
솣
렼
푯
됳
귐
읻
띃
튝
퍌
혿
샊
슼
궆
볘
벞
됯
겾
묨
뉵
촨
뢴
홎
촟
꼳
촸
깢
춭
킂
훕
웟
욷
닒
뫄
춖
눂
곗
녛
쯘
녿
꿏
긏
벛
쟹
툿
짯
뵜
뇩
얁
뎜
곺
탼
앶
뱕
먗
랻
둧
짼
쳠
꾾
빍
휸
킅
긒
뜼
섁
킈
읹
떸
똧
킻
덚
깸
봎
탛
렻
괓
밓
줴
딷
횹
텸
벱
넞
쵹
켁
좼
룝
쇱
빩
뙜
띡
촹
쯕
맇
턕
탙
탗
돚
쾰
섦
럳
챃
뀸
텟
뀬
캈
윹
휄
잳
턀
푁
뿤
왐
땇
괃
묏
왰
슿
묯
괬
갊
웂
놎
핢
늡
펏
흧
츢
믇
옫
뮫
굗
풓
궇
땽
뉼
쟃
벍
땃
퇑
왇
삧
켝
왗
혺
떹
탞
껜
톺
읶
껓
뿢
샗
풑
츱
쇡
깩
쌂
걉
떶
믁
닯
뒝
싑
싦
콮
섧
칯
푝
킽
멐
낣
꿴
닏
뱆
흦
걲
럋
돜
꽆
탇
퍅
찪
빱
탣
쏯
듞
욲
뱝
촙
땉
떷
딝
씈
켭
닩
꽅
혂
둫
푿
칳
셐
흨
뢱
춬
틉
녯
꾳
븜
냍
횓
퇀
숚
졂
녋
흄
튱
꿐
눋
랰
횎
뚣
찭
앺
탘
쾡
쉊
럅
냰
냌
걘
냊
뺠
뮴
띰
왱
쨀
탂
즊
삣
붑
