<unk>
<pad>
<sos>
<eos>
<MASK>
 
이
.
다
는
고
하
에
가
니
지
요
을
어
도
로
서
기
아
은
한
시
있
리
해
나
의
사
게
보
라
주
들
,
으
인
수
를
스
만
!
그
면
자
정
데
일
대
습
오
제
0
마
장
구
상
부
소
드
전
무
것
입
여
1
었
분
원
과
되
더
비
세
거
좋
진
안
2
신
내
문
간
먹
음
모
동
트
까
용
생
방
~
우
와
저
맛
매
치
했
러
성
바
할
말
야
공
단
중
같
없
려
물
미
적
실
위
네
차
개
합
많
래
너
조
운
?
때
식
화
집
품
유
금
않
터
번
히
작
감
선
크
ㅋ
5
년
3
양
예
경
연
두
국
잘
계
행
건
당
점
산
재
업
며
심
던
겠
)
후
각
랑
등
늘
피
파
반
영
았
포
처
타
남
르
관
배
레
^
발
명
살
함
체
ㅎ
(
알
디
추
님
능
청
달
편
날
카
회
받
4
프
직
든
민
된
강
느
교
월
람
역
통
워
천
버
싶
노
께
올
탄
6
준
렇
코
불
"
본
난
길
출
루
근
런
테
학
른
호
름
색
걸
현
속
복
약
죠
곳
9
설
료
질
최
답
력
갈
확
결
짜
온
또
친
임
메
격
-
평
절
못
ㅠ
왔
블
새
록
필
티
립
담
'
참
목
얼
울
환
족
였
초
글
변
림
져
판
커
돌
린
셔
종
외
럼
열
찍
따
즈
눈
급
특
태
플
맞
엄
8
완
줄
접
브
키
듯
밥
손
증
활
페
항
막
량
책
채
법
머
형
팅
찾
뉴
7
언
석
셨
택
:
볼
순
향
e
토
표
겨
송
별
착
움
귀
김
란
침
앞
쓰
창
박
빠
갔
누
충
희
좀
꽃
뷔
육
o
m
백
꾸
릴
될
놓
독
즘
힘
베
션
/
깔
긴
애
술
클
i
넣
취
렸
꼭
십
놀
냥
망
녀
럽
잡
끔
a
큼
득
봐
끼
검
됩
봤
넘
끝
골
찬
권
쪽
링
및
군
>
풍
케
딱
랍
락
씨
먼
r
험
S
투
혼
돈
층
랜
낌
억
<
쁘
삼
t
류
n
엔
광
즐
익
큰
탁
켜
돼
M
높
써
씩
병
s
%
액
l
짐
C
센
풀
존
푸
슬
몇
덕
웃
잠
빛
깨
D
P
악
응
폰
짝
A
황
릭
밀
쿠
읽
퍼
벌
패
벽
축
잔
T
찮
빨
휴
뒤
북
객
론
g
갑
싱
E
쉬
궁
튼
졌
팬
곡
허
견
효
몰
L
*
쉽
둘
볶
붙
냉
싸
염
련
뭐
I
쁜
핑
렴
굴
째
탕
떠
혀
닭
왜
ㅜ
괜
념
닌
멋
렌
줘
몸
욕
컨
밖
철
떡
닥
꼬
탈
G
c
쳐
팔
찌
톡
널
혹
봅
극
넓
칠
껴
콘
벤
홈
걱
녁
+
욱
숙
옆
꼼
헤
죽
엘
맥
츠
솔
콤
냐
p
징
났
k
캐
웠
승
홍
찰
픈
뿌
d
킨
챙
뷰
믿
랐
떤
떨
떻
규
뜻
댓
율
빵
뿐
꺼
B
겁
봉
컬
템
텐
듣
첨
N
밤
맘
K
델
[
;
촉
첫
왕
텔
칭
]
롭
u
닐
균
R
V
샤
O
멀
뻐
슨
셀
총
춤
협
#
튜
F
옷
틀
암
슈
갖
앉
범
늦
낙
녹
뜨
톤
됐
칼
맨
흔
웨
측
덜
곤
겹
딸
엽
램
봄
척
y
빌
몬
줬
납
쯤
떼
혈
삭
딩
콜
엇
팡
밝
룸
좌
옥
퇴
v
꿀
끗
h
릇
슴
켓
밑
얘
펜
므
춰
W
쇼
줍
콩
쌈
킹
씀
빼
컴
농
힐
폭
흑
잇
옵
흐
잖
깐
눌
획
흥
넉
혜
흰
굉
냄
낮
싫
묵
삶
뛰
롱
듬
윤
촬
쓸
켰
률
H
얻
뭔
겼
릿
앤
넷
팀
닝
햇
꽤
깊
b
샌
섬
롤
끌
잊
흡
졸
잎
끓
압
샀
폐
끄
렵
=
즉
캠
&
깃
령
촌
짧
꿈
벗
짓
펴
녕
랙
U
둥
핸
벨
짱
튀
빈
씬
퓨
빙
굽
례
젠
앙
끈
곁
헬
젤
겸
렉
닫
찜
곱
낸
뭘
땐
셋
벼
쭉
숨
뒷
맵
덩
똑
짬
털
밌
쌀
샐
랬
껍
냈
쌓
w
픽
섯
틱
럴
롯
흘
슷
캔
뮤
곧
팩
x
틴
잉
낼
X
싹
섞
핫
ㅡ
뽑
땅
괴
샘
숯
춘
씻
즙
쩌
칙
랄
묘
_
략
꽉
킬
컷
룩
훨
맡
펌
샴
퀄
큐
폴
캘
낄
쾌
홀
쥬
섭
읍
둔
껏
f
힌
곰
쟁
쓴
릉
묻
뽕
웅
뚜
샵
멍
걷
눠
혔
뚝
턴
멘
옮
랫
벅
싼
엉
Q
렛
깜
휘
뿍
탱
멜
잃
샷
렀
썹
섹
앨
탐
J
빔
띄
즌
값
쑥
닙
쫄
홉
훈
끊
맙
꽂
렁
삿
듭
굳
맑
엠
쫀
볍
옴
삐
뼈
쇄
굿
짠
럭
묶
캡
틈
꼈
밭
믹
눔
옛
뀌
팍
낀
랩
쏙
칸
핀
쏘
숭
뢰
띠
숍
닦
겉
돋
훌
죄
쁨
Y
쭈
쿨
얀
햄
논
폼
겐
몽
씹
겪
룹
탑
됨
팁
놔
왠
닉
뜯
댄
젝
붕
헌
쳤
숲
덮
껑
힙
깝
젊
낚
넌
텀
똥
멈
쩔
긁
뽀
짤
융
@
좁
뱅
놨
핏
엑
팝
빗
젖
줌
젓
늬
빡
븐
퀴
둑
픔
쌍
맹
셜
덧
쏠
숫
썼
팽
녔
핵
밴
뇌
ㄷ
갓
틸
냠
혁
쏟
밍
붉
솥
긋
슥
쇠
왼
쨌
펼
쪼
릅
첩
겟
컵
멤
ㅇ
빅
뜬
닮
딜
붓
앵
깥
얇
돔
뚫
탭
찐
텍
윈
맺
앱
j
꼽
긍
웬
꽁
팥
낫
셉
땡
멕
꾼
륭
횟
곶
덤
륨
쩍
놈
뜸
넬
닛
덥
킷
꿔
옳
쉴
웹
닿
퍽
톱
뤄
륜
ㅅ
z
툰
뜩
랭
윗
펀
뭇
썰
뱃
멸
땀
귤
뻤
뭉
뻔
닷
앗
넛
낳
펙
톰
룰
넥
뜰
댁
얗
쟈
찔
펄
낭
뎅
딘
밟
칩
짭
뿜
Z
꿍
쌤
큘
솜
굵
숟
냅
렐
앰
텁
듀
뚱
늄
퐁
밸
콰
흉
썩
짚
뉘
얹
푼
찢
푹
훔
솟
썸
룡
늑
캬
툼
턱
왈
칵
섰
쿵
헐
렬
펠
갚
잦
딥
떄
쭤
찻
깁
윰
엣
엿
렘
뾰
댐
꼴
삽
팟
깡
맴
쥐
낯
릎
`
빚
퀘
덴
춥
곽
콕
댕
탓
툭
옹
돕
붐
뽐
q
몹
롬
팜
딴
갭
낱
죵
렷
쫙
쫓
꾹
쓱
퉁
쿄
늠
탠
풋
뒀
썬
낡
쁠
뿅
칫
찼
혐
욤
컥
몫
짙
뱀
깎
찹
궈
잣
셈
컸
됬
팠
흠
쩡
둬
쿼
볕
씁
둠
킴
랴
얄
흙
캣
깍
헹
숱
탬
텃
힝
둡
쉐
갱
뚤
갤
찝
쎄
벚
쪄
짰
젯
킥
엎
휠
헛
갯
쫑
웰
ㄱ
갬
쉼
쩜
뇨
돗
귓
뎌
숴
욥
뻥
깻
셰
걀
쫌
쨍
륵
$
툇
벳
늉
찡
슝
롸
잼
묽
얌
씌
옇
쭝
ㅈ
떴
뮬
쭌
룬
뀐
눴
뻗
왁
쫘
깬
꺅
톨
횡
쩐
잤
촤
뺀
봇
쁩
벙
좔
뀔
촘
뺄
ㅌ
잌
훼
왓
띈
멧
씰
뎀
껄
앓
쬐
탔
헷
빴
핌
굶
츄
춧
췄
벡
쟤
윽
숄
챕
휙
뻑
큽
댈
욧
뗄
퀵
뵙
궤
챗
쿰
퇘
펑
뮨
랠
ㅂ
퀸
댔
뇸
꺽
뒹
헝
잽
펫
딪
툴
옐
꿨
눕
ㄴ
맣
뇽
뜹
훅
싣
옻
뺏
걍
쑤
꽝
헿
꺄
훗
갛
륙
갠
쥔
짖
랗
냇
얜
킵
딧
멓
밋
췌
쯔
찿
쌩
섀
읊
웍
훑
숩
캅
쐬
ㄹ
첵
휩
얽
밈
튠
잭
딕
쾅
둣
톳
텨
빕
츰
겔
펭
껀
ㅣ
괄
켈
헥
싯
욜
ㅏ
맷
슐
{
}
뻣
땠
욘
촐
얕
끙
ㅑ
꿋
녤
핼
엊
웁
쏭
끽
슭
콧
삔
챠
튤
퉜
뿔
쿡
뵈
솝
딤
첼
윌
팻
쌉
휼
좆
떳
꼰
넋
껌
퀀
꽈
럇
깅
퓰
룻
믈
촛
캉
렝
굼
릳
꿉
밉
넨
롷
랏
깼
ㅊ
웩
슉
텝
뛴
궜
낍
씽
긔
겜
쵝
쵸
뉠
쨈
썽
곸
꼐
쏴
ㅉ
끕
킼
젼
됫
딨
섣
럿
땜
촥
켠
룽
숑
왤
걔
덱
뺐
댑
읏
쫜
슛
볐
켄
졍
숏
뭣
옾
챔
귄
땋
훤
ㅓ
뭍
겻
뎈
쉰
핳
뺍
뻘
꺾
쨔
읔
쐴
젛
쨋
똠
컹
밧
쎈
갸
쉑
굣
렙
샬
켕
젭
줏
뜀
뉸
흩
쿸
쟝
눅
셧
훠
옅
넜
뙇
댜
샹
뤼
튕
깹
똘
짊
긩
뭅
붇
굥
헉
튈
뫼
닳
샛
칡
잰
녘
쉿
꿇
캄
뺑
갇
뎃
쫏
쌌
퉈
냘
끅
꿰
핥
늙
콱
챡
핍
쭐
궂
쥘
맸
뤠
덟
궐
괘
챤
뵐
푀
닼
쨘
뼛
휀
뎠
좇
쟀
췟
펍
컾
텅
팎
홋
멩
듦
봬
컫
놉
쩨
곘
솨
껭
쫒
텆
팸
죸
꺋
넴
똔
죤
짘
욺
썻
쪗
켯
똻
녓
좍
짆
똭
돵
쑵
쟎
쌘
좐
홧
멱
쨕
틔
엥
삑
뱉
쬬
푠
넹
쩝
ㅔ
ㅕ
봣
텼
쿱
댱
뚬
쑨
긜
홓
줫
씐
ㄸ
쨰
쥴
띕
뽝
ㅁ
ㅗ
쥑
듕
잿
믓
읎
옶
믄
넙
갰
챱
둟
꾀
맏
캍
ㅆ
짦
띁
흫
앏
햤
떙
쏜
떫
폈
졋
긱
돠
펐
핰
눼
쟌
땨
ㅐ
젹
뭄
뤈
뺨
긇
쓔
딮
찟
깆
낏
띵
훜
읕
휨
먀
둿
띤
흗
쪘
풉
넝
쾃
ㄳ
몄
뱄
띔
떱
챰
숖
얍
뗐
픕
퓌
틑
켤
뼘
뤘
쌔
