<unk>
<pad>
<sos>
<eos>
<MASK>
 
e
박
그
빨
꽌
쥰
숫
닺
지
밉
낼
고
맙
읏
착
묻
듈
깊
될
맴
개
ㄹ
국
생
총
믾
햘
몯
컵
1
펙
욫
롯
씨
훤
옥
흑
훈
뭋
갇
옂
눗
웉
친
쿼
쵸
쨌
t
신
쫓
겅
룹
덬
됀
렿
증
칼
믿
됱
!
2
>
젛
즁
늘
라
쁠
셈
숴
메
릊
뺘
욌
츙
냬
젇
알
뭘
좃
꼈
밧
장
닉
굼
쏙
녙
챰
퍙
흠
픠
샌
야
퉌
돈
뜯
짭
서
독
옐
량
겆
밸
읍
싸
뽐
였
발
눟
좆
샀
툰
먾
음
균
곧
틈
득
플
가
맞
뎐
죠
붖
질
흙
왈
쏠
썩
땡
망
꺼
꾹
돟
ㅎ
뷰
십
췄
싼
보
대
돋
됭
뱡
셌
갤
캠
혐
g
괒
므
쬐
줄
킴
쩨
햑
뺀
됮
튼
첱
넋
트
웆
률
밀
거
잏
쥼
읔
펌
빛
터
햡
틔
롱
S
짬
낌
즌
춰
쁘
렆
격
함
O
밝
탁
촘
솜
연
깝
띠
높
핯
큼
환
섵
여
짓
겐
임
뵙
?
쑥
톤
컥
척
쿤
쳐
팡
악
섣
멸
늦
빡
겟
짰
몪
듀
냥
v
호
황
취
뚜
륵
슈
뿌
숭
읖
난
늧
펀
릏
렴
횬
극
덤
랠
홛
돕
탹
슐
=
렷
를
꿇
퍽
랃
몰
컴
배
섶
듳
싞
윌
꼉
습
변
립
닠
뚱
밐
런
긎
쓱
섹
얃
뭌
넙
뇸
듶
옛
빔
땐
낰
웇
봤
힉
왕
/
촉
쳥
봅
우
샢
담
릋
껀
잖
력
렁
잗
체
굿
욱
맬
3
북
향
래
측
챌
)
뎔
걍
긨
낚
놓
괴
흉
닻
복
것
갘
댓
땀
몼
꾜
넚
뽕
휘
헛
탠
즙
듭
쭤
껬
탄
ㅣ
깔
켰
-
못
페
d
퀵
롣
갭
퇴
은
굑
믕
쇠
늑
얏
노
냘
졋
표
욕
묫
픙
넨
꼭
뉸
끙
잎
o
댔
먄
뱨
k
옆
맠
땨
걑
볕
좉
탱
부
D
링
샂
쩌
놨
왁
넛
깍
팽
푠
굮
늠
꼼
작
록
섷
흘
갬
찾
7
젖
패
철
댤
찻
켱
덴
둉
캘
직
룩
P
시
로
핳
엉
킷
답
퀄
뭔
흩
꽂
웅
틴
갠
웥
낄
숍
죵
겍
E
뜰
돌
낑
두
띄
맂
륜
젝
뜻
맀
방
점
웠
씌
먈
뀔
깉
훌
샵
농
섭
둘
텐
꽁
혈
핏
렀
랔
첩
걈
열
짠
티
싱
퐁
빚
써
림
뚯
팁
아
안
렄
륭
큭
샤
폼
놏
돔
뷔
꿀
륨
ㄱ
긴
댜
샨
쯤
땠
쟐
갈
줗
술
릎
렘
훗
굳
경
큰
덩
범
놈
등
콕
쌈
삑
샷
졀
힝
미
탖
맵
됐
닫
털
붕
G
닭
주
짊
ㄷ
딸
랩
밈
퍄
손
맡
쿨
뵤
뭏
끌
솨
녈
율
멤
쏟
람
졸
얻
을
순
솟
헙
횡
깎
광
뤘
쫄
츤
`
툼
잼
뭇
봐
녀
웬
훔
뎡
뒈
쇽
벡
봍
툥
옷
긍
행
쌕
렐
샡
처
넉
곁
윈
캄
둗
헠
챙
쇼
혜
츌
냉
뒤
돤
듬
폐
섰
릭
봇
굉
땋
0
갸
게
밭
졷
걱
같
빋
씸
칭
먜
뭊
빗
맟
뚫
댬
민
루
몬
씻
셰
자
뢰
닦
룬
젹
삐
몆
랬
렌
공
밍
낀
쭝
옃
꼽
ㄴ
둣
텍
칰
닙
때
냑
궂
쿠
욤
팰
늪
카
또
둡
뭎
찔
텽
마
풀
께
걷
믈
춥
쯔
뱌
뻔
뒀
뎌
쉼
뽄
싷
맹
절
푸
윗
봏
억
싯
긐
썬
만
텬
흥
쳘
추
눔
침
형
랴
칵
~
뜸
묙
쪼
놋
덥
금
귀
각
샃
뭣
탔
과
벽
H
허
쥔
한
킥
접
획
쁩
륙
먆
윙
셨
슷
퉁
렵
둔
츼
기
뿜
얽
붓
츰
늄
삼
목
딤
럿
읒
볼
힜
역
갑
엊
뎨
쑤
찼
쭉
팢
킹
껑
뀐
말
건
능
얐
쁨
엘
오
떵
뺏
덨
다
팼
저
먀
러
넝
앜
잦
햔
밚
닽
태
찮
릉
듸
설
맨
댝
른
까
:
잠
렂
첼
뇽
깻
좁
뤼
몉
곳
끔
퓸
뻗
앙
컷
반
퀸
끼
푀
쳑
눕
앝
뻤
;
몽
굵
싹
듣
ㅈ
쉽
톄
곰
럼
텨
볓
썰
첸
릌
받
헁
슘
줘
쫙
면
겪
최
힘
쪽
샙
빅
옸
위
색
잌
덕
떻
*
괄
짜
눌
닷
룐
유
석
논
밋
핍
뮤
성
글
쌩
(
썽
찰
값
깇
혼
옾
밌
업
잣
뽁
컾
밖
녔
볶
퍼
냠
겿
찯
횽
갖
됰
윰
혀
Z
투
중
홰
뵬
랕
홀
앗
채
깡
즈
커
<
홍
됬
왜
쓸
섴
슌
크
숄
핟
띈
넷
딨
X
팜
{
햍
번
례
김
넜
m
꽤
캡
탬
J
선
곘
걀
둬
낱
앚
쓰
꺄
청
뜽
당
R
샏
첯
굥
암
쑬
쵀
엿
앟
눤
촤
ㅁ
피
삔
멩
욧
나
바
[
텁
롭
류
웤
뽑
옅
듲
샆
탑
굶
앤
됴
뚠
렦
썸
규
딪
통
판
츄
쁜
솬
돝
B
귤
얄
매
곹
퓨
찐
늨
멘
z
좋
끄
론
드
렜
펜
꾼
족
+
솎
뜩
깋
흔
첨
맑
괘
혖
얗
옻
앛
옄
셕
젤
징
겻
븡
윽
압
쌌
셉
찬
덧
픔
뛰
쌓
련
핸
딱
닸
빕
믹
염
ㅡ
쑴
릴
섞
삽
햋
룍
턍
젯
u
녹
놔
^
병
콘
ㅏ
천
에
탸
첰
랏
엽
뵈
쾌
궁
퍈
뻐
홫
눚
펼
타
먹
샐
쐬
벝
묽
긔
닾
코
C
월
었
햄
산
속
냅
되
완
줏
#
짗
뱅
엔
해
뱓
츠
책
찌
읗
톨
뭄
후
춫
젓
톼
져
뚤
첟
틱
줍
엠
ㅑ
벚
관
헀
춴
룻
문
톷
첮
묭
씁
샬
핫
뮨
엄
싲
입
쟤
앞
융
잒
깬
쿰
봊
옵
적
A
ㅜ
액
맘
첳
의
킨
씰
옮
튜
브
쫀
쥐
턔
퐌
짇
껏
밬
톰
낲
룽
동
뱔
젠
헌
셩
꽈
짤
닜
롤
슺
긑
활
쏘
핀
잍
멷
쩜
씬
꿉
홭
쌍
샟
y
팩
춘
앨
ㅂ
몇
새
즘
깨
죄
n
잰
촬
V
뎠
힙
r
법
졌
덮
댑
챗
뻑
뫃
셔
훑
올
밮
몀
숸
감
블
움
뱃
틍
남
칩
꺽
럄
뿅
쟁
옇
층
는
앋
_
짝
눈
학
영
뭐
솓
벗
렛
돼
쩡
섕
정
냐
줃
쫌
횟
겈
팔
좇
븨
횔
년
깆
싣
팟
넘
M
낯
눅
폰
벌
널
슛
슨
떄
갂
벨
햇
꽃
댕
뜨
깥
혙
백
님
똘
녁
챡
잩
칬
텼
냄
웢
듕
숩
란
맺
뭬
풉
쉴
빵
빽
툴
f
,
뇨
팅
햐
잽
롬
궐
팎
듴
궨
킁
쥭
곻
쉰
잤
흰
헝
뇬
굘
횐
]
삿
젼
짛
랗
렇
꿑
헤
찢
굽
9
녘
럾
뜬
엌
씀
떡
필
댱
}
핵
평
이
핮
탕
쭐
뒷
흡
덦
밴
데
뻘
랂
웃
펴
쳤
즤
긱
콰
누
욘
펑
끠
긋
났
껴
붘
솽
있
얌
모
촌
츅
혇
뵥
첫
컸
툭
갔
겉
념
먁
닛
볌
q
밟
홈
T
닌
킬
팥
ㅅ
옹
렬
견
편
눙
묜
N
늬
던
와
듷
뻥
푹
골
치
a
맏
혔
뱉
돛
짂
ㅊ
테
톡
효
겁
엑
딩
휠
꾸
템
씩
꼴
차
캉
종
히
@
툐
키
옿
폍
봉
들
솔
렉
샴
앓
숯
양
w
컹
컫
덭
댠
헷
좌
토
멋
웹
싶
깜
낵
|
릅
잇
쨔
빤
곃
낫
어
쿵
뤈
특
셧
앰
왓
읓
멍
샹
뿍
벼
떠
텄
쓴
쩔
인
뢀
빈
돠
읽
졈
세
앴
큐
르
쇄
맄
곶
았
단
퀴
틸
ㅌ
j
칫
회
몹
싳
렸
휴
얹
뭉
칺
왔
힌
심
x
숲
엳
쨍
쩍
화
내
잴
뗄
헐
힐
헥
맊
앉
조
첪
즏
텀
겔
둠
본
듵
녖
뵹
뷱
슬
촛
볍
벳
괕
좊
파
갓
원
탆
챵
비
확
뤄
찜
갰
솰
팀
략
챔
룸
료
꿔
릿
겋
물
며
&
슭
잊
죽
상
벜
할
계
뮬
늙
셜
볐
랸
괔
퀘
ㅋ
겸
봄
베
곽
됼
훙
땅
샄
뿐
l
홉
참
롼
즐
닝
젊
됩
짱
클
희
몫
돗
졔
앖
펠
뗘
너
군
욭
깃
언
럐
제
숰
레
혗
곤
딜
요
펫
밫
겠
든
포
톱
덜
낙
헬
겹
맢
캔
햤
믜
졍
찡
뒨
봌
뙨
귓
찝
뱐
곡
욥
걔
칠
"
않
잭
쩐
얂
니
스
텝
온
뉘
좔
갼
L
왼
쳬
집
디
튿
뷴
눠
넬
붗
삳
꿈
웋
뻡
얕
둰
맣
된
켓
축
븐
쿄
댄
멱
헸
멜
줬
%
텩
넥
곷
챠
녜
맫
택
큽
펄
쉐
릐
교
밎
끝
꿘
깐
냔
젙
롲
식
몈
섯
떤
깈
춍
밪
8
껍
빌
꾀
끗
찍
쎄
으
낳
W
딛
샇
밥
뺄
워
픈
따
쟉
일
잋
숀
맥
댈
옳
욜
햠
럽
윳
썼
4
랫
괌
댸
뒜
틀
췌
재
갱
룰
콧
꺾
댁
s
눴
켠
콤
텃
웜
꼬
앵
껌
똥
얺
뽀
읺
젂
사
쥴
응
쳔
팍
섀
휙
퐈
쟝
탐
딴
쉬
끽
샅
섬
갹
붉
쫘
읕
춤
큘
막
Y
럭
전
썹
떳
벙
뀌
팠
얘
벋
욍
탓
뿔
뢍
릍
붐
권
합
h
빧
멀
줓
짖
납
탭
됵
U
폭
얼
급
욬
먼
솥
떼
듯
혁
핲
$
느
쫑
컬
쑨
멕
팬
뾰
깅
b
쌔
검
첬
하
늉
엎
둑
름
짚
짘
쥬
캣
낸
풍
닮
꿰
줌
벤
무
껼
근
숙
흐
뉴
녤
뭍
날
멎
꽉
뺨
빠
컨
칸
햬
엮
출
더
랑
ㅇ
겄
외
밯
랍
찹
섳
붛
6
뎅
Q
뱍
몸
핼
뽈
네
톹
삶
결
충
덟
갗
볻
헨
묶
잃
.
욛
헿
낞
쟈
울
픽
놀
웡
둥
겯
훅
핻
밤
텂
팝
뎍
p
닥
먕
싴
버
린
넓
초
숱
왠
준
갯
잘
펵
5
갚
잉
톧
웰
뱇
턱
휩
렫
항
살
죤
곂
프
괸
엇
퓌
떨
궈
c
랒
꼐
쭌
낭
슝
강
락
냈
육
칙
캬
존
구
겼
믄
닪
숨
뚀
푼
켜
소
분
뇌
뙤
I
빼
윤
셋
및
똑
갛
끈
F
없
텔
했
잧
줕
딥
실
긁
깁
웈
웁
도
쪄
익
챼
뎀
많
뎁
운
좀
길
숟
험
걸
겨
콩
넌
불
쌤
쏜
랙
낡
'
송
랄
멉
샘
샛
혘
씅
진
뎄
챀
델
끊
빙
쎠
괜
애
용
케
션
품
캐
뵨
샜
삭
창
팄
섲
럈
댐
녕
뒹
딕
퉈
램
젗
닐
탈
뚝
붙
훼
룡
즉
굴
센
딘
수
턴
슴
엣
뻣
쌀
엾
헹
츨
넣
혹
뱀
랐
븍
밑
엏
닼
얇
훨
죈
콜
승
켈
롸
싫
떴
띤
껄
붚
텅
낮
령
옴
풋
춧
렅
욨
뷸
핰
릇
벅
씹
싀
얖
쭈
궤
꿍
려
셍
닿
싵
명
랜
늩
칮
짐
달
예
별
핌
젘
앱
협
얀
웨
짧
폴
곱
귝
잔
챈
머
끓
현
뀨
ㅠ
됨
튀
폈
째
촐
핑
랭
잡
뼈
K
셀
맛
핱
멈
잿
i
묵
짙
약
뼌
냇
슥
헉
럴
리
덪
웍
간
묘
핚
객
얓
