<unk>
<pad>
<sos>
<eos>
<MASK>
 
이
.
다
는
고
하
에
가
니
지
요
을
어
로
도
서
기
아
은
시
한
있
리
해
나
의
사
,
게
보
라
!
인
주
수
들
으
스
를
만
면
그
자
0
정
일
대
습
데
오
제
구
상
장
드
부
마
1
소
전
입
무
2
여
원
세
것
~
분
비
과
었
거
되
더
진
안
신
좋
문
내
트
동
용
모
간
매
음
생
우
방
까
치
먹
저
공
와
바
할
성
러
했
ㅋ
중
적
물
맛
미
실
단
야
개
말
위
려
같
네
없
합
품
조
래
많
차
식
운
3
?
때
너
유
5
금
화
)
터
집
작
번
크
않
선
히
경
양
감
업
^
예
연
건
(
행
두
ㅎ
산
년
계
점
당
국
후
잘
피
재
심
파
포
며
각
관
겠
늘
영
타
반
레
4
발
던
카
랑
등
았
배
르
체
처
남
명
디
청
추
-
알
함
능
님
e
프
통
날
월
살
된
회
받
천
편
6
버
강
달
직
9
교
워
역
든
/
:
느
람
o
료
본
코
싶
민
께
호
출
준
올
노
루
'
t
근
름
렇
테
불
설
7
복
곳
학
약
현
8
길
a
색
"
난
른
런
질
속
ㅠ
격
죠
확
결
메
답
걸
최
친
블
또
임
력
담
필
울
티
절
새
온
평
립
i
탄
록
판
목
갈
초
왔
못
글
페
종
s
짜
참
즈
환
m
변
였
플
셔
따
린
형
져
족
얼
커
브
r
특
활
열
외
림
키
찾
손
급
태
증
맞
법
항
토
n
엄
팅
찍
돌
럼
완
택
셨
접
막
듯
언
송
볼
눈
줄
머
량
밥
뉴
채
별
표
겨
l
S
c
향
누
책
순
움
희
창
빠
릴
란
p
김
석
박
쓰
착
귀
꽃
앞
션
충
침
클
육
베
백
좀
애
될
술
g
골
C
갔
힘
A
즘
꾸
독
케
T
P
권
긴
*
됩
취
험
링
넣
꼭
놓
놀
M
깔
및
검
씨
넘
h
끝
락
렸
층
봐
>
쪽
득
끔
E
군
잡
망
랜
찬
럽
녀
봤
투
냥
끼
류
엔
D
낌
즐
큼
랍
억
딱
광
탁
삼
u
뷔
%
병
혼
I
L
쁘
풍
먼
십
돈
액
d
[
센
]
높
<
큰
k
객
밀
잠
악
익
존
써
켜
씩
N
릭
휴
웃
퍼
패
y
갑
축
풀
쿠
깨
푸
황
허
핑
련
G
쉬
졌
론
궁
짝
컨
벌
철
+
견
응
덕
돼
벽
몇
짐
슬
잔
폰
O
곡
ㅜ
B
쉽
몸
뒤
효
읽
쁜
몰
싱
북
빨
탕
볶
째
닌
염
R
싸
튼
찮
빛
냉
혀
=
K
둘
닭
탈
츠
렴
뭐
b
톡
떡
홈
팔
봉
;
w
렌
욕
v
밖
떠
뷰
죽
쳐
붙
극
굴
꼼
F
념
괜
찌
승
왜
줘
넓
멋
욱
헤
떨
혹
콘
걱
템
솔
숙
팬
칠
#
V
뿐
홍
벤
빵
징
규
닥
픈
캐
맥
컬
널
뿌
옆
봅
킨
꼬
뜻
녁
웠
꺼
엘
떤
율
콤
났
냐
첫
껴
겁
암
믿
맘
쇼
텐
W
H
샤
슈
총
슨
첨
떻
밤
찰
댓
갖
델
옷
칼
룸
딩
f
롭
왕
맨
텔
챙
앉
엇
랐
틀
칭
촉
웨
척
&
납
협
튜
램
뜨
균
빌
닐
됐
범
듣
U
뻐
녹
셀
컴
퇴
멀
곤
랙
힐
_
춤
줍
냄
흔
딸
측
톤
농
x
겹
떼
봄
덜
낙
옵
춰
늦
X
좌
엽
삭
밝
펜
옥
낮
빼
깐
켓
콜
팡
줬
혜
쯤
넉
킹
씀
팀
끗
몬
혈
콩
삶
획
므
흑
롱
녕
앤
릿
넷
흐
밑
폭
꿀
잖
끈
겼
흡
씬
J
꿈
빈
흥
듬
꽤
뭔
닝
젤
슴
짧
촬
핸
즉
털
령
퓨
앙
잇
펴
릇
튀
샀
얘
압
팩
뛰
싫
굉
짱
윤
깊
캠
쥬
둥
쓸
햇
틱
례
벨
ㅡ
픽
얻
졸
묵
눌
렵
켰
럴
롤
쌈
춘
률
잉
잊
흰
홀
깃
짓
폐
끓
끄
끌
셋
잎
롯
빙
슷
큐
땐
Y
똑
섬
뒷
젠
샌
벗
핫
낸
헬
럭
쌀
짬
찜
훨
숨
벼
촌
맡
폴
턴
렉
랬
컷
겸
밌
낼
섭
섯
샵
쟁
쌓
샐
룩
껍
땅
흘
싹
덩
곧
뽕
벅
Q
논
쾌
섞
뭘
냈
뮤
랄
략
닫
껏
샷
뚜
곁
샘
킬
캔
멜
굽
굿
몽
칙
곱
틴
훈
곰
쭉
멘
걷
랫
힌
싼
괴
즙
탱
쩌
낄
랩
씻
휘
둔
쓴
읍
뽑
릉
멍
퀄
묻
웅
혔
j
펌
숯
깜
쑥
맑
꽉
눠
쏘
밴
듭
맵
즌
샴
숭
톱
쫄
묘
옮
빅
잃
뚝
값
캡
탑
썹
칸
빔
굳
뱅
볍
@
렁
뽀
뿍
뢰
맙
렛
렀
쇄
왼
닉
뜯
엉
캘
뼈
쿨
밍
옛
띄
띠
쁨
얀
빗
폼
쫀
앨
밭
숲
믹
꽂
컵
핀
쏙
묶
엠
탐
뚫
섹
닦
닙
젊
핏
훌
얇
퀴
왠
돋
낀
z
겉
죄
똥
쳤
팍
끊
둑
겪
뇌
좁
틈
옴
됨
앱
쭈
솥
흉
룹
Z
짠
갓
셉
겟
덤
덮
삐
릅
껑
뀌
깝
멈
낚
홉
겐
썼
쏠
놨
씹
셜
놔
삿
닷
눔
젝
팝
팁
쪼
펼
융
붓
꼈
낭
툰
햄
귤
꼽
핵
갤
윈
긋
댁
덧
첩
쇠
놈
맹
븐
릎
쌍
엑
픔
뜰
땀
젓
냠
숫
닿
짤
찐
랭
웹
숍
앗
줌
ㄷ
륭
텍
쩔
쏟
붕
ㅑ
푹
댄
힙
땡
넌
텀
뭉
젖
빡
헌
팽
윗
딜
찔
늬
썰
솜
틸
넛
긁
ㅇ
쥐
듀
앰
댕
ㅂ
밸
ㅁ
슥
렬
푼
옹
찝
삽
팟
ㅅ
썬
왁
잼
봇
헛
휠
횡
캉
밧
룽
